Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/claiming_a_social_welfare_payment/social_insurance_contributions_from_abroad.html.txt.tmx
Source language: en
Languages: ga

source: Combining social insurance contributions from abroad
ga: Ranníocaíochtaí árachais shóisialta ón choigríoch a chomhcheangal

source: Ireland has social security arrangements with other countries that allow you to combine social insurance contributions that you have paid in Ireland with social insurance contributions that you have paid in another country
ga: Tá socruithe slándála sóisalaí ag Éirinn le tíortha eile mar a cheadaítear tú do ranníocaíochtaí árachais sóisialaí a íoctar in Éirinn a chomhcheangal le do ranníocaíochtaí árachais sóisialaí a íoctar i dtír eile

source: This can help you to qualify for a social insurance payment in Ireland or in a country with whom Ireland has a social security arrangement
ga: Is féidir leis seo a chuidiú leat le bheith incháilithe do íocaíocht árachais sóisialta in Éirinn nó i dtír lena bhfuil socrú slándála sóisialaí ag Éirinn

source: Social security arrangements that Ireland has with other countries can be divided broadly into two groups:
ga: Is feidir socruithe slándála sóisialaí atá ag Éirinn le tíortha eile a roinnt go leathan ina ndá ghrúpa:

source: • Countries covered by European Union (EU) regulations
ga: • Tíortha ata clúdaithe ag rialacháin an Aontais Eorpaigh (AE)/an Limistéir Eorpaigh Eacnamaíoch (LEE)

source: • Countries with whom Ireland has Bilateral Social Security Agreements
ga: • Tíortha lena bhfuil Socruithe Slándála Sóisialaí Déthaobhacha ag Éirinn

source: Countries covered by EU regulations
ga: Tíortha clúdaithe ag Rialacháin AE/LEE

source: Social security provisions have existed in EU law for more than 30 years
ga: Tá forálacha slándála sóisialaí ann i ndlí an AE le níos mó ná 30 bliain

source: They are contained in Regulation (EC) No 883/2004 and 987/2009
ga: Tá siad i Rialacháin (CEE) Uimhreacha 883/2004 agus 987/2009 ina n-ionad

source: The EU/EEA countries covered by these Regulations are: Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Liechtenstein, Luxembourg, Latvia, Lithuania, Malta, Norway, Portugal, Poland, Romania, Spain, Sweden, Switzerland, Slovakia, Slovenia, Netherlands, and the United Kingdom (including the Channel Islands and the Isle of Man - see 'Bilateral social security agreements' below)
ga: Is iad na tíortha AE/LEE atá clúdaithe ag na Rialacháin seo ná: an Ostair, an Bheilg, an Bhulgáir, an Chróit, an Chipir, Poblacht na Seice, an Danmhairg, an Eastóin, an Fhionlainn, an Fhrainc, an Ghearmáin, an Ghréig, an Ungáir, an Íoslainn, Éire, an Iodáil, an Laitvia, Lichtinstéin, an Liotuáin, Lucsamburg, Málta, an Iorua, an Pholainn, an Phortaingéil, an Rómáin, an tSlóvaic, an tSlóivéin, an Spáinn, an tSualainn, an Eilvéis, an Ísiltír, an Ríocht Aontaithe (lasmuigh d'Oileáin Mhuir nIocht)

source: EU regulations relating to social security generally apply to the following people:
ga: Tá Rialacháin AE/LEE a bhaineann le slándáil shóisialta infheidhmithe leis na daoine a leanas go ginearálta:

source: • Nationals of the countries covered by the regulations
ga: • Náisiúnaigh na dtíortha atá clúdaithe ag na Rialacháin

source: • People with the status of stateless people or refugees who are living permanently in any of the countries covered by the regulations and their dependants or survivors
ga: • Daoine leis an stádas de dhaoine gan stát nó teifigh atá ina gcónaí go buan in aon cheann de na tíortha atá clúdaithe ag na Rialacháin agus a gcleithiúnaithe nó marthanóirí

source: If you have worked in Ireland and one or more EU state your social insurance contributions from each EU state will be added to your Irish social insurance contributions to help you qualify for one of the social welfare payments listed below
ga: Más rud é gur oibrigh tú in Éirinn agus i gceann nó níos mó de stait an AE cuirfear do ranníocaíochtaí árachais sóisialta ó gach stát an AE le do ranníocaíochtaí árachais sóisalta in Éirinn le cuidiú leat a bheith incháilithe do cheann de na híocaíochtaí leasa sóisialta atá liostaithe thíos

source: In the case of some payments (for example, Jobseeker's Benefit, Illness Benefit and Maternity Benefit) your last social insurance contribution must be paid in Ireland
ga: I gcás íocaíochtaí áirithe caithfidh do ranníocaíocht árachais sóisialaigh is déanaí bheith íoctha in Éirinn.:

source: • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: Countries with whom Ireland has Bilateral Social Security Agreements
ga: Tíortha lena bhfuil Socruithe Slándála Sóisialaí Déthaobhacha ag Éirinn

source: Bilateral Social Security Agreements are specific arrangements between participating countries that allow people to move between countries and protect their pension entitlements
ga: Is socruithe sainiúla iad Socruithe Slándála Sóisialaí Déthaobhacha idir tíortha rannpháirteacha a cheadaíonn daoine le bogadh idir tíortha agus a chosnaíonn a dteidlíochtaí pinsin

source: Ireland has Bilateral Social Security Agreements with:
ga: Tá Socruithe Slándála Sóisialaí Déthaobhacha ag Éirinn le:

source: Ireland's Bilateral Social Security Agreement with Switzerland has been mainly replaced by EU regulations
ga: Athchuireadh Socrú Slándála Sóisialaí Déthaobhach na hÉireann leis An Eilvéis go príomha ag Rialacháin an AE

source: The benefits covered by bilateral social security agreements are:
ga: Is iad na sochair atá clúdaithe ag socruithe slándála sóisialaí déthaobhacha ná:

source: • Widows, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: The bilateral social security agreements are of greatest relevance for pensioners who retire to Ireland after working in one of the countries listed above
ga: Is í an ábharthacht is mó atá ag na socruithe slándála sóisialaí déthaobhacha ná do phinsinéirí a dtéann ar scor chuig Éirinn tar éis dóibh bheith ag obair i gceann de na tíortha liostaithe thuas

source: If you have come from a country with which Ireland has a Bilateral Social Security Agreement, your pension rights from the other country are protected when you move to Ireland
ga: Má tháinig tú ó thír lena bhfuil socrú slándála sóisialaí déthaobhach ag Éirinn, beidh do chearta pinsin ón tír eile cosanta nuair a bhogann tú chuig Éirinn

source: It is possible to have a pension from Ireland and one or all of the other countries
ga: Is féidir pinsean a bheith agat óÉirinn agus ó cheann amhain nó ó gach ceann de na tíortha eile

source: You may be able to combine your insurance records from Ireland and the other country to qualify for a State Pension (Contributory)
ga: Féadtar go mbeidh tú ábalta do chuntais árachais ó Éirinn agus ón tír eile a chomhcheangal le bheith incháilithe le Pinsean Stáit (Ranníocach)

source: When you are filling in or completing an application for an Irish social insurance payment, there is a section on the application form that will ask you whether you have ever been employed in an EU country other than Ireland
ga: Nuair atá foirm iarratais ar íocaíocht árachais sóisialta in Éirinn á líonadh nó á comhlánadh agat, tá rannán san fhoirm iarratais a iarrann cé acu an raibh tú riamh i bhfostaíocht i dtír eile an AE seachas Éire

source: In the case of long-term payments you will be asked if you have ever been employed in an EU country or a country with whom Ireland has a bi-lateral social security agreement
ga: Maidir le híocaíochtaí fadtéarmacha iarrfar cé acu an raibh tú riamh i bhfostaíocht i dtír an AE nó i dtír lena bhfuil socrú slándála sóisialaí déthaobhach ag Éirinn

source: You will be asked for the following information:
ga: Iarrfar an fhaisnéis a leanas ort:

source: • The country where you worked
ga: • An tír a d'oibrigh tú ann

source: • The name and address of your employer there
ga: • Ainm agus seoladh an fhostaitheora ansin

source: • The dates you worked there
ga: • Na dátaí a d'oibrigh tú ansin

source: • Your Social Security Number there
ga: • Agus d'Uimhir Slándála Sóisialaí ansin

source: To claim a social welfare payment you should fill out the correct application form and return it to the Department of Social Protection
ga: Chun íocaíocht leasa sóisialta a éileamh ba chóir duit an fhoirm chuí a líonadh agus í a chur ar ais chuig An Roinn Coimirce Sóisialaí

source: The return address is printed on the application form
ga: Tá an seoladh fillte priontáilte ar an fhoirm iarratais

source: Further information about your Irish social insurance record is available from:
ga: Tá tuilleadh eolais faoi do chuntas árachais sóisialta in Éirinn ar fáil ó:

source: How your social insurance contributions from other states are calculated
ga: An dóigh a dhéantar do ranníocaíochtaí árachais sóisialta ó stáit eile a ríomh

source: If you have worked in another EU state or a country with which Ireland has a bi-lateral social security agreement, the social insurance contributions you have paid there may help you to qualify for an Irish social insurance payment
ga: Más rud é gur oibrigh tú i stát eile an AE nó i dtír lena bhfuil socrú slándála sóisialaí ag Éirinn féadtar go gcuideódh na ranníocaíochtaí arachais sóisialta a d'íoc tú ansin leat bheith incháilithe d'íocaíocht árachais sóisialta in Éirinn

source: Under EU regulations, specifically Regulation EEC No
ga: Faoi rialacháin an AE, go hairithe Rialachán CEE Uimh

source: 883/2004 (pdf) (was 1408/71), entitlements built up in one EU member state should be recognised when calculating benefit entitlement in another
ga: 883/2004 (pdf) (1408/71 roimhe seo), ba chóir go ndéanfaí teidlíochtaí a thógtar i stát amháin an AE a aithint agus teidlíochtaí sochair á ríomh i stát eile

source: You should get forms U1 (formerly E301) and E104 when you leave an EU country where you have worked
ga: Ba chóir go dtabharfaí foirmeacha U1 (E301 roimhe seo) agus E104 nuair a fhágann tú tír an AE ina raibh tú ag obair

source: These forms are available at the relevant social security agency in the country you are coming from and provide details of your social insurance record
ga: Tá na foirmeacha seo ar fáil ag an ghníomhaireacht slándála sóisialaí ábhartha sa tír óna dtagann tú agus soláthraíonn siad sonraí faoi do chuntas árachais sóisialta

source: Form E104 is needed if you apply for sickness benefits and form U1 is required for unemployment benefits
ga: Tá Foirm E104 riachtanach má chuireann tú iarratas isteach ar shochar tinnis agus tá Foirm U1 riachtanach ar chúiseanna sochair dífhostaíochta

source: For example, if you are applying for Illness Benefit, send a copy of your E104 with your application for Illness Benefit
ga: Mar shampla, má tá iarratas á chur isteach agat le haghaidh sochair tinnis, seol cóip de d'fhoirm E104 le d'iarratas ar Shochair Tinnis

source: It will speed up the processing of your application
ga: Déanfaidh sé próiseáil d'iarratais a luathú

source: If you don’t have form E104 from the relevant EU countries you have worked in, once you state the other countries you have worked in on your application form the Department of Social Protection will obtain the relevant details for you
ga: Muna bhfuil foirm U1 agat ó na tíortha ábhartha AE a d'oibrigh tú iontu, nuair a luann tú na tíortha eile a d'oibrigh tú iontú ar d'fhoirm iarratais gheobhaidh An Roinn Coimirce Sóisialaí na sonraí ábhartha duit

source: Before coming to Ireland, you should check with the local social security office in the country you are working in about the appropriate documentation to bring with you
ga: Sula dtiocfaidh tú chuig Éirinn, ba chóir duit seiceáil leis an oifig slándala sóisialaí áitiúil sa tír ina bhfuil tú ag obair maidir leis na doiciméid chuí le tabhairt leat

source: Bi-lateral Social Security Agreements
ga: Socruithe Slándála Sóisialaí Déthaobhacha

source: Contributions paid in states with which Ireland has a bi-lateral social security agreement will only cover you for certain long-term payments, such as, the State Pension (Contributory), Invalidity Pension, Widow’s, Widower’s or Surviving Civil Partner's (Contributory) Pension, andGuardian’s Payment (Contributory)
ga: Ní chlúdóidh ranníocaíochtaí a íocadh i stáit lena bhfuil socrú slándála sóisialaí déthaobhach ag Éirinnach amháin íocaíochtaí fadtéarmacha áirithe mar, an Pinsean Stáit (Ranníocach), an Pinsean Easláine, an Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) agus Íocaíocht Chaomhnóra (Ranníocach)

source: You must have been in insurable employment for at least one week in Ireland for a bilateral agreement to apply and (except in the case of Guardian’s Payment (Contributory)) have a minimum of 52 reckonable weeks under Irish legislation
ga: Ba chóir go raibh tú i bhfostaíocht inárachais le seachtain amháin ar a laghad in Éirinn chun socrú déthaobhach a bheith infheidhmithe agus (seachas i gcás Íocaíochta Chaomhóra (Ranníocach)) ba chóir íoslíon de 52 seachtain inríofa faoi reachtaíocht na hÉireann a bheith agat

source: If you apply for one of the above social insurance payments in Ireland and put in your application that you have worked in a country with which Ireland has a bi-lateral social security agreement the Department of Social Protection will do the following:
ga: Ma chuireann tú isteach ar cheann de na híocaíochtaí slándála sóisialaí thuasluaite in Éirinn agus má chuireann tú i d'fhoirm iarratais gur oibrigh tú i dtír lena bhfuil socrú slándála sóisialaí ag Éirinn déanfaidh An Roinn Coimirce Sóisialaí na rudaí a leanas:

source: • If you have enough Irish social insurance contributions to get an Irish payment the Department will pay it and also initiate, on your behalf, a claim in the other country you worked in
ga: • Ma tá ranníocaíochtaí slándála sóisialaí go leor agat chun uas-íocaíocht a fháil íocfaidh an Roinn sin agus cuirfidh sí tús, ar do shonsa, le héileamh sa tír eile ina raibh tú ag obair

source: • If you do not have enough social insurance contributions the Department will request your social insurance record from the other country to help you qualify for an Irish social insurance payment and also initiate, on your behalf, a claim in the other country that you have worked
ga: • Muna bhfuilI ranníocaíochtaí slándála sóisialaí go leor agat iarrfaidh an Roinn ar do chuntas árachais sóisialta ón tír eile le cuidiú leat bheith incháilithe le haghaidh íocaíochta árachais sóisialta in Éirinn agus cuirfidh sí tús, ar do shonsa, le héileamh sa tír eile ina raibh tú ag obair

source: This means you can get more than one payment; you can get an Irish payment and a payment from another country
ga: Ciallaíonn sé seo gur féidir leat níos mó ná íocaíocht amháin a fháil; is féidir leat íocaíocht a fháil in Éirinn agus íocaíocht ó thír eile

source: The rate of pension or payment, where insurance contributions in another country are being combined with Irish contributions, is calculated as follows:
ga: Déantar ráta an phinsin nó na híocaíochta, nuair atá ranníocaíochtaí arachais i dtír eile á gcomhcheangal le ranníocaíochtaí in Éirinn, a ríomh mar a leanas:

source: Your notional pension is calculated
ga: Déantar do phinsean barúlach a ríomh

source: Notional pension is the rate of Irish pension which would be payable if all your social insurance contributions, both Irish and non-Irish, were treated as Irish contributions
ga: Is é an pinsean barúlach ná ráta an phinsin Éireannaigh a bheadh iníoctha dá ndéanfaí plé le do ranníocaíochtaí árachais sóisialta go léir, in Éirinn agus lasmuigh d'Éirinn ar aon, mar ranníocaíochtaí Éireannacha

source: To get the yearly average number of contributions, your Irish and non-Irish reckonable contributions are added together and the total is then divided by the number of years (this is, the number of years from your first paid social insurance contribution to the end of the tax year before reaching pension age (66))
ga: Le teacht ar líon na ranníocaíochtaí bliantúla ar an meán, déantar do ranníocaíochtaí Éireannacha agus do ranníocaíochtaí ináirithe neamh-Éireannacha a chur le chéile agus iad a roinnt ansin faoi líon na mblianta (is é sin le rá líon na mblianta ó d’íoc tú árachas sóisialta den chéad uair go deireadh na bliana cánach sular shroich tú aois an phinsin (66))

source: The following formula is then applied:
ga: Cuirtear an fhoirmle a leanas i bhfeidhm ansin

source: A = the notional rate of pension
ga: A = ráta barúlach an phinsin

source: (See step 1 to calculate the notional rate of pension.)
ga: (féach céim 1 chun ráta barúlach an phinsin a ríomh.)

source: B = the number of Irish contributions
ga: B = líon na ranníocaíochtaí Éireannacha

source: C = the total number of contributions (Irish + foreign)
ga: C = líon iomlán na ranníocaíochtaí (Éireannacha agus coimhthíocha)

source: In the agreements with Austria, Australia, Canada, Quebec and UK, (as under EU legislation), where there are less than 52 contributions paid in the other country and a pension is not awarded by that country, the Irish pension is awarded on the sum of the two insurance records without the application of the pro-rata rule
ga: Sna socruithe leis An Ostair, An Astráil, Ceanada, Quebec agua an RA, (mar atá faoi reachtaíocht an AE), nuair a íocadh níos lú ná 52 ranníocaíocht sa tír eile agus nach ndámhtar pinsean sa tír sin, dámhtar an pinsean Éireannach ar shuim an dá chuntais árachais gan cur i bhfeidhm na rialach pro-rata
